SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/HAL_Lib/inc/hal_flexcan.h
/***********************************************************************************************************************
    @file     hal_flexcan.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE FLEXCAN FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef __HAL_FLEXCAN_H
#define __HAL_FLEXCAN_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "mm32_device.h"

/** @addtogroup MM32_StdPeriph_Driver
  * @{
  */
/** @defgroup FLEXCAN
  * @{
  */

/** @defgroup FLEXCAN_Exported_Types
  * @{
  */

/* FLEXCAN module features */
/**
  * @brief Is affected by errata with ID 5829 (FlexCAN: FlexCAN does not transmit a message
  * that is enabled to be transmitted in a specific moment during the arbitration process).
  */
#define FLEXCAN_HAS_ERRATA_5829 (0)

/**
  * @brief Is affected by errata with ID 9595 (FlexCAN: Corrupt frame possible if the Freeze Mode
  * or the Low-Power Mode are entered during a Bus-Off state)
  */
#define FLEXCAN_HAS_ERRATA_9595 (1)

/**
 * @brief Message buffer size
 */
#define FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(x) (32)

/**
  * @brief Has a receive FIFO DMA feature (register bit field MCR[DMA]).
  */
#define FLEXCAN_HAS_RX_FIFO_DMA (0)

#define FLEXCAN_WAIT_TIMEOUT (1000U)


/* The count of CAN_WORD0 */
#define CAN_WORD0_COUNT                          (32U)
/* The count of CAN_WORD1 */
#define CAN_WORD1_COUNT                          (32U)


/**
  * @brief FlexCAN Frame ID helper macro.
  */
#define FLEXCAN_ID_STD(id) \
        (((uint32_t)(((uint32_t)(id)) << FLEXCAN_ID_STD_Pos)) & FLEXCAN_ID_STD_Msk) /*!< Standard Frame ID helper macro. */
#define FLEXCAN_ID_EXT(id)                                    \
        (((uint32_t)(((uint32_t)(id)) << FLEXCAN_ID_EXT_Pos)) & (FLEXCAN_ID_EXT_Msk | FLEXCAN_ID_STD_Msk)) /*!< Extend Frame ID helper macro. */


/**
  * @brief FlexCAN Rx Message Buffer Mask helper macro.
  */
#define FLEXCAN_RX_MB_STD_MASK(id, rtr, ide)                                       \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
         FLEXCAN_ID_STD(id))           /*!< Standard Rx Message Buffer Mask helper macro. */
#define FLEXCAN_RX_MB_EXT_MASK(id, rtr, ide)                                       \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
         FLEXCAN_ID_EXT(id))           /*!< Extend Rx Message Buffer Mask helper macro. */

/**
  * @brief FlexCAN Rx FIFO Mask helper macro.
  */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_A(id, rtr, ide)                              \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
         ((id << FLEXCAN_ID_STD_Pos) << 1))        /*!< Standard Rx FIFO Mask helper macro Type A helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_B_HIGH(id, rtr, ide)                         \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
         (((uint32_t)(id) & 0x7FF) << 19)) /*!< Standard Rx FIFO Mask helper macro Type B upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_B_LOW(id, rtr, ide)                          \
        (((uint32_t)((uint32_t)(rtr) << 15) | (uint32_t)((uint32_t)(ide) << 14)) | \
         (((uint32_t)(id) & 0x7FF) << 3))  /*!< Standard Rx FIFO Mask helper macro Type B lower part helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_HIGH(id) \
        (((uint32_t)(id) & 0x7F8) << 21)   /*!< Standard Rx FIFO Mask helper macro Type C upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_MID_HIGH(id) \
        (((uint32_t)(id) & 0x7F8) << 13)   /*!< Standard Rx FIFO Mask helper macro Type C mid-upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_MID_LOW(id) \
        (((uint32_t)(id) & 0x7F8) << 5)    /*!< Standard Rx FIFO Mask helper macro Type C mid-lower part helper macro. */
#define FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_LOW(id) \
        (((uint32_t)(id) & 0x7F8) >> 3)    /*!< Standard Rx FIFO Mask helper macro Type C lower part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_A(id, rtr, ide)                              \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
         ((id << FLEXCAN_ID_EXT_Pos) << 1))        /*!< Extend Rx FIFO Mask helper macro Type A helper macro. */
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_B_HIGH(id, rtr, ide)  /*!< Extend Rx FIFO Mask helper macro Type B upper part helper macro. */                           \
        (((uint32_t)((uint32_t)(rtr) << 31) | (uint32_t)((uint32_t)(ide) << 30)) | \
            (((id << FLEXCAN_ID_EXT_Pos) & 0x1FFF8000) << 1))
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_B_LOW(id, rtr, ide) /*!< Extend Rx FIFO Mask helper macro Type B lower part helper macro. */                          \
        (((uint32_t)((uint32_t)(rtr) << 15) | (uint32_t)((uint32_t)(ide) << 14)) | \
         (((id << FLEXCAN_ID_EXT_Pos) & 0x1FFF8000) >> 15))
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_HIGH(id) \
        (((id << FLEXCAN_ID_EXT_Pos) & 0x1FE00000) << 3)  /*!< Extend Rx FIFO Mask helper macro Type C upper part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_MID_HIGH(id) \
        (((id << FLEXCAN_ID_EXT_Pos) & 0x1FE00000) >> 5) /*!< Extend Rx FIFO Mask helper macro Type C mid-upper part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_MID_LOW(id) \
        (((id << FLEXCAN_ID_EXT_Pos) & 0x1FE00000) >> 13)/*!< Extend Rx FIFO Mask helper macro Type C mid-lower part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_LOW(id) \
        (((id << FLEXCAN_ID_EXT_Pos) & 0x1FE00000) >> 21) /*!< Extend Rx FIFO Mask helper macro Type C lower part helper macro. */

/**
  * @brief FlexCAN Rx FIFO Filter helper macro.
  */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_A(id, rtr, ide) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_A(id, rtr, ide) /*!< Standard Rx FIFO Filter helper macro Type A helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_B_HIGH(id, rtr, ide) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_B_HIGH(id, rtr, ide) /*!< Standard Rx FIFO Filter helper macro Type B upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_B_LOW(id, rtr, ide) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_B_LOW(id, rtr, ide) /*!< Standard Rx FIFO Filter helper macro Type B lower part helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_C_HIGH(id) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_HIGH(id)/*!< Standard Rx FIFO Filter helper macro Type C upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_C_MID_HIGH(id) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_MID_HIGH(id) /*!< Standard Rx FIFO Filter helper macro Type C mid-upper part helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_C_MID_LOW(id) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_MID_LOW(id)  /*!< Standard Rx FIFO Filter helper macro Type C mid-lower part helper macro. */
#define FLEXCAN_RX_FIFO_STD_FILTER_TYPE_C_LOW(id) \
        FLEXCAN_RX_FIFO_STD_MASK_TYPE_C_LOW(id) /*!< Standard Rx FIFO Filter helper macro Type C lower part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_A(id, rtr, ide) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_A(id, rtr, ide) /*!< Extend Rx FIFO Filter helper macro Type A helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_B_HIGH(id, rtr, ide) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_B_HIGH(id, rtr, ide) /*!< Extend Rx FIFO Filter helper macro Type B upper part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_B_LOW(id, rtr, ide) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_B_LOW(id, rtr, ide) /*!< Extend Rx FIFO Filter helper macro Type B lower part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_C_HIGH(id) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_HIGH(id)      /*!< Extend Rx FIFO Filter helper macro Type C upper part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_C_MID_HIGH(id) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_MID_HIGH(id)  /*!< Extend Rx FIFO Filter helper macro Type C mid-upper part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_C_MID_LOW(id) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_MID_LOW(id)   /*!< Extend Rx FIFO Filter helper macro Type C mid-lower part helper macro. */
#define FLEXCAN_RX_FIFO_EXT_FILTER_TYPE_C_LOW(id) \
        FLEXCAN_RX_FIFO_EXT_MASK_TYPE_C_LOW(id)       /*!< Extend Rx FIFO Filter helper macro Type C lower part helper macro. */

/**
  * @brief FlexCAN FD Rx FIFO Filter helper macro.
  */

#define FLEXCAN_FD_RX_FIFO_STD_FILTER_TYPE_0(id, rtr, id_msk, rtr_msk) \
    ((uint32_t)(((uint32_t)(0x00) << 30) | ((uint32_t)(rtr) << 27) | ((uint32_t)(id) << 16) | ((uint32_t)(rtr_msk) << 11) | ((uint32_t)(id_msk) << 0)))          

#define FLEXCAN_FD_RX_FIFO_STD_FILTER_TYPE_1(id2, rtr, id1, rtr_msk) \
    ((uint32_t)(((uint32_t)(0x01) << 30) | ((uint32_t)(rtr) << 27) | ((uint32_t)(id2) << 16) | ((uint32_t)(rtr_msk) << 11) | ((uint32_t)(id1) << 0)))          

#define FLEXCAN_FD_RX_FIFO_STD_FILTER_TYPE_2(id2, rtr2, id1, rtr1) \
    ((uint32_t)(((uint32_t)(0x02) << 30) | ((uint32_t)(rtr2) << 27) | ((uint32_t)(id2) << 16) | ((uint32_t)(rtr1) << 11) | ((uint32_t)(id1) << 0)))          


#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_0_0(id, rtr) \
    ((uint32_t)(((uint32_t)(0x00) << 30) | ((uint32_t)(rtr) << 29) | ((uint32_t)(id) << 0)))          
#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_0_1(id_msk, rtr_msk) \
    ((uint32_t)(((uint32_t)(rtr_msk) << 29) | ((uint32_t)(id_msk) << 0)))          

#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_1_0(id2, rtr) \
    ((uint32_t)(((uint32_t)(0x01) << 30) | ((uint32_t)(rtr) << 29) | ((uint32_t)(id2) << 0)))          
#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_1_1(id1, rtr_msk) \
    ((uint32_t)(((uint32_t)(rtr_msk) << 29) | ((uint32_t)(id1) << 0)))  

#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_2_0(id2, rtr2) \
    ((uint32_t)(((uint32_t)(0x02) << 30) | ((uint32_t)(rtr2) << 29) | ((uint32_t)(id2) << 0)))          
#define FLEXCAN_FD_RX_FIFO_EXT_FILTER_TYPE_2_1(id1, rtr1) \
    ((uint32_t)(((uint32_t)(rtr1) << 29) | ((uint32_t)(id1) << 0)))  


