SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/HAL_Lib/inc/hal_flexcan.h
#define FLEXCAN_ERFDID_EXT_Pos                      (0U)
#define FLEXCAN_ERFDID_EXT_Msk                      (0x3FFFFU)
#define FLEXCAN_ERFDID_STD_Pos                      (18U)
#define FLEXCAN_ERFDID_STD_Msk                      (0x1FFC0000U)
#define FLEXCAN_ERFCS_IDE_Msk                       (0x200000U)
#define FLEXCAN_ERFCS_RTR_Msk                       (0x100000U)
#define FLEXCAN_ERFCS_DLC_Msk                       (0xF0000U)
#define FLEXCAN_ERFCS_DLC_Pos                       (16U)
#define FLEXCAN_ERFCS_TIME_STAMP_Pos                (0U)
#define FLEXCAN_ERFCS_TIME_STAMP_Msk                (0xFFFFU)

/**
  * @brief Generic status return codes.
  */
#define    Status_Flexcan_Success                0x00000000    /*!< Generic status for Success. */
#define    Status_Flexcan_Fail                   0x00000001    /*!< Generic status for Fail. */
#define    Status_Flexcan_ReadOnly               0x00000002    /*!< Generic status for read only failure. */
#define    Status_Flexcan_OutOfRange             0x00000003    /*!< Generic status for out of range access. */
#define    Status_Flexcan_InvalidArgument        0x00000004    /*!< Generic status for invalid argument check. */
#define    Status_Flexcan_Timeout                0x00000005    /*!< Generic status for timeout. */
#define    Status_Flexcan_NoTransferInProgress   0x00000006    /*!< Generic status for no transfer in progress. */


/**
  * @brief FlexCAN transfer status.
  */
#define    Status_Flexcan_TxBusy                 0x00010000    /*!< Tx Message Buffer is Busy. */
#define    Status_Flexcan_TxIdle                 0x00010001    /*!< Tx Message Buffer is Idle. */
#define    Status_Flexcan_TxSwitchToRx           0x00010002    /*!< Remote Message is send out and Message buffer changed to Receive one. */
#define    Status_Flexcan_RxBusy                 0x00010003    /*!< Rx Message Buffer is Busy. */
#define    Status_Flexcan_RxIdle                 0x00010004    /*!< Rx Message Buffer is Idle. */
#define    Status_Flexcan_RxOverflow             0x00010005    /*!< Rx Message Buffer is Overflowed. */
#define    Status_Flexcan_RxFifoBusy             0x00010006    /*!< Rx Message FIFO is Busy. */
#define    Status_Flexcan_RxFifoIdle             0x00010007    /*!< Rx Message FIFO is Idle. */
#define    Status_Flexcan_RxFifoOverflow         0x00010008    /*!< Rx Message FIFO is overflowed. */
#define    Status_Flexcan_RxFifoWarning          0x00010009    /*!< Rx Message FIFO is almost overflowed. */
#define    Status_Flexcan_RxFifoDisabled         0x0001000A   /*!< Rx Message FIFO is disabled during reading. */
#define    Status_Flexcan_ErrorStatus            0x0001000B   /*!< FlexCAN Module Error and Status. */
#define    Status_Flexcan_WakeUp                 0x0001000C   /*!< FlexCAN is waken up from STOP mode. */
#define    Status_Flexcan_UnHandled              0x0001000D   /*!< UnHadled Interrupt asserted. */
#define    Status_Flexcan_RxRemote               0x0001000E   /*!< Rx Remote Message Received in Mail box. */
#define    Status_Flexcan_RxFifoUnderflow        0x0001000F   /*!< Enhanced Rx Message FIFO is underflow. */

/**
  * @brief FlexCAN FD Rx FIFO interrupt
  */
#define    FlexCANFD_RxFifoUsableInterrupt      FLEXCAN_ERFIER_ERFDAIE_Msk        /*!< Enhanced Rx FIFO usable interrupt. */
#define    FlexCANFD_RxFifoWaterlineInterrupt   FLEXCAN_ERFIER_ERFWMIIE_Msk       /*!< Enhanced Rx FIFO waterline interrupt. */
#define    FlexCANFD_RxFifoOverflowInterrupt    FLEXCAN_ERFIER_ERFOVFIE_Msk       /*!< Enhanced Rx FIFO overflow interrupt. */
#define    FlexCANFD_RxFifoUnderflowInterrupt   FLEXCAN_ERFIER_ERFUFWIE_Msk       /*!< Enhanced Rx FIFO underflow interrupt. */

/**
  * @brief FlexCAN FD Rx FIFO status
  */
#define    FlexCANFD_RxFifoUsable      FLEXCAN_ERFSR_ERFDA_Msk                    /*!< Enhanced Rx FIFO usable status. */
#define    FlexCANFD_RxFifoWaterline   FLEXCAN_ERFSR_ERFWMI_Msk                   /*!< Enhanced Rx FIFO waterline status. */
#define    FlexCANFD_RxFifoOverflow    FLEXCAN_ERFSR_ERFOVF_Msk                   /*!< Enhanced Rx FIFO overflow status. */
#define    FlexCANFD_RxFifoUnderflow   FLEXCAN_ERFSR_ERFUFW_Msk                   /*!< Enhanced Rx FIFO underflow status. */
#define    FlexCANFD_RxFifoEmpty       FLEXCAN_ERFSR_ERFE_Msk                     /*!< Enhanced Rx FIFO empty status. */
#define    FlexCANFD_RxFifoFull        FLEXCAN_ERFSR_ERFF_Msk                     /*!< Enhanced Rx FIFO full status. */


enum _flexcan_state {
    Enum_Flexcan_StateIdle     = 0x0,                                           /*!< MB/RxFIFO idle. */
    Enum_Flexcan_StateRxData   = 0x1,                                           /*!< MB receiving. */
    Enum_Flexcan_StateRxRemote = 0x2,                                           /*!< MB receiving remote reply. */
    Enum_Flexcan_StateTxData   = 0x3,                                           /*!< MB transmitting. */
    Enum_Flexcan_StateTxRemote = 0x4,                                           /*!< MB transmitting remote request. */
    Enum_Flexcan_StateRxFifo   = 0x5,                                           /*!< RxFIFO receiving. */
};


/**
  * @brief FlexCAN frame format.
  */
typedef enum _flexcan_frame_format
{
    Enum_Flexcan_FrameFormatStandard = 0x0U, /*!< Standard frame format attribute. */
    Enum_Flexcan_FrameFormatExtend   = 0x1U  /*!< Extend frame format attribute. */
} flexcan_frame_format_t;

/**
  * @brief FlexCAN frame type.
  */
typedef enum _flexcan_frame_type
{
    Enum_Flexcan_FrameTypeData   = 0x0U, /*!< Data frame type attribute. */
    Enum_Flexcan_FrameTypeRemote = 0x1U  /*!< Remote frame type attribute. */
} flexcan_frame_type_t;

/**
  * @brief FlexCAN clock source.
  */
typedef enum _flexcan_clock_source
{
    Enum_Flexcan_ClkSrc0    = 0x0U,    /*!< FlexCAN Protocol Engine clock selected by user as SRC == 0. */
    Enum_Flexcan_ClkSrc1    = 0x1U     /*!< FlexCAN Protocol Engine clock selected by user as SRC == 1. */
} flexcan_clock_source_t;

/**
  * @brief FlexCAN wake up source.
  */
typedef enum _flexcan_wake_up_source
{
    Enum_Flexcan_WakeupSrcUnfiltered = 0x0U, /*!< FlexCAN uses unfiltered Rx input to detect edge. */
    Enum_Flexcan_WakeupSrcFiltered   = 0x1U  /*!< FlexCAN uses filtered Rx input to detect edge. */
} flexcan_wake_up_source_t;

/**
  * @brief FlexCAN Rx Fifo Filter type.
  */
typedef enum _flexcan_rx_fifo_filter_type
{
    Enum_Flexcan_RxFifoFilterTypeA = 0x0U, /*!< One full ID (standard and extended) per ID Filter element. */
    Enum_Flexcan_RxFifoFilterTypeB = 0x1U, /*!< Two full standard IDs or two partial 14-bit ID slices per ID Filter Table element. */
    Enum_Flexcan_RxFifoFilterTypeC = 0x2U, /*!< Four partial 8-bit Standard or extended ID slices per ID Filter Table element. */
    Enum_Flexcan_RxFifoFilterTypeD = 0x3U  /*!< All frames rejected. */
} flexcan_rx_fifo_filter_type_t;

/**
  * @brief FlexCAN FD Rx Fifo Filter type.
  */
typedef enum _flexcan_fd_rx_fifo_filter_type 
{
    Enum_Flexcan_FD_RxFifoFilterType0 = 0x0U,                                   /*!< The filter scheme is based on mask and filter. */
    Enum_Flexcan_FD_RxFifoFilterType1 = 0x1U,                                   /*!< The filter scheme is based on range. */
    Enum_Flexcan_FD_RxFifoFilterType2 = 0x2U,                                   /*!< The filter scheme is based on two filters without masks. */
} flexcan_fd_rx_fifo_filter_type_t;

/**
  * @brief FlexCAN FD Rx Fifo Filter format.
  */
typedef enum _flexcan_fd_rx_fifo_filter_format {
    Enum_Flexcan_FD_RxFifoFilterFormatSTD = 0x0U,                               /*!< Standard ID filter element. */
    Enum_Flexcan_FD_RxFifoFilterFormatEXT = 0x1U,                               /*!< Extended filter element. */
} flexcan_fd_rx_fifo_filter_format_t;


/**
  * @brief FlexCAN Message Buffer Payload size.
  */
typedef enum _flexcan_mb_size
{
    FLEXCAN_8BperMB  = 0x0U,           /*!< Selects 8 bytes per Message Buffer. */
    FLEXCAN_16BperMB = 0x1U,           /*!< Selects 16 bytes per Message Buffer. */
    FLEXCAN_32BperMB = 0x2U,           /*!< Selects 32 bytes per Message Buffer. */
    FLEXCAN_64BperMB = 0x3U            /*!< Selects 64 bytes per Message Buffer. */
} flexcan_mb_size_t;

/**
  * @brief  FlexCAN Rx FIFO priority.
  * The matching process starts from the Rx MB(or Rx FIFO) with higher priority.
  * If no MB(or Rx FIFO filter) is satisfied, the matching process goes on with
  * the Rx FIFO(or Rx MB) with lower priority.
  */
typedef enum _flexcan_rx_fifo_priority
{
    Enum_Flexcan_RxFifoPrioLow  = 0x0U, /*!< Matching process start from Rx Message Buffer first */
    Enum_Flexcan_RxFifoPrioHigh = 0x1U  /*!< Matching process start from Rx FIFO first */
} flexcan_rx_fifo_priority_t;

/**
  * @brief  FlexCAN interrupt configuration structure, default settings all disabled.
  *
  * This structure contains the settings for all of the FlexCAN Module interrupt configurations.
  * Note: FlexCAN Message Buffers and Rx FIFO have their own interrupts.
  */
enum _flexcan_interrupt_enable
{
    Enum_Flexcan_BusOffInterruptEnable    = FLEXCAN_CTRL1_BOFFMSK_Msk, /*!< Bus Off interrupt. */
    Enum_Flexcan_ErrorInterruptEnable     = FLEXCAN_CTRL1_ERRMSK_Msk,  /*!< Error interrupt. */
    Enum_Flexcan_RxWarningInterruptEnable = FLEXCAN_CTRL1_RWRNMSK_Msk, /*!< Rx Warning interrupt. */
    Enum_Flexcan_TxWarningInterruptEnable = FLEXCAN_CTRL1_TWRNMSK_Msk, /*!< Tx Warning interrupt. */
    Enum_Flexcan_WakeUpInterruptEnable    = FLEXCAN_MCR_WAKMSK_Msk,     /*!< Wake Up interrupt. */
    Enum_Flexcan_FDErrorInterruptEnable   = FLEXCAN_CTRL2_ERRMSKFAST_Msk /*!< CAN FD Error interrupt, use bit 31. */
};


/**
  * @brief  FlexCAN status flags.
  *
  * This provides constants for the FlexCAN status flags for use in the FlexCAN functions.
  * Note: The CPU read action clears FlEXCAN_ErrorFlag, therefore user need to
  * read FlEXCAN_ErrorFlag and distinguish which error is occur using
  * @ref _flexcan_error_flags enumerations.
  */
enum _flexcan_flags
{
    Enum_Flexcan_SynchFlag            = FLEXCAN_ESR1_SYNCH_Msk,   /*!< CAN Synchronization Status. */
    Enum_Flexcan_TxWarningIntFlag     = FLEXCAN_ESR1_TWRNINT_Msk, /*!< Tx Warning Interrupt Flag. */
    Enum_Flexcan_RxWarningIntFlag     = FLEXCAN_ESR1_RWRNINT_Msk, /*!< Rx Warning Interrupt Flag. */
    Enum_Flexcan_IdleFlag             = FLEXCAN_ESR1_IDLE_Msk,    /*!< CAN IDLE Status Flag. */
    Enum_Flexcan_FaultConfinementFlag = FLEXCAN_ESR1_FLTCONF_Msk, /*!< Fault Confinement State Flag. */
    Enum_Flexcan_TransmittingFlag     = FLEXCAN_ESR1_TX_Msk,      /*!< FlexCAN In Transmission Status. */
    Enum_Flexcan_ReceivingFlag        = FLEXCAN_ESR1_RX_Msk,      /*!< FlexCAN In Reception Status. */
    Enum_Flexcan_BusOffIntFlag        = FLEXCAN_ESR1_BOFFINT_Msk, /*!< Bus Off Interrupt Flag. */
    Enum_Flexcan_ErrorIntFlag         = FLEXCAN_ESR1_ERRINT_Msk,  /*!< Error Interrupt Flag. */
    Enum_Flexcan_ErrorFlag            = (int)(                 /*!< All FlexCAN Error Status. */
        FLEXCAN_ESR1_BIT1ERR_Msk | FLEXCAN_ESR1_BIT0ERR_Msk | FLEXCAN_ESR1_ACKERR_Msk |
        FLEXCAN_ESR1_CRCERR_Msk | FLEXCAN_ESR1_FRMERR_Msk | FLEXCAN_ESR1_STFERR_Msk)
};

/**
  * @brief  FlexCAN error status flags.
  *
  * The FlexCAN Error Status enumerations is used to report current error of the FlexCAN bus.
  * This enumerations should be used with Enum_Flexcan_ErrorFlag in @ref _flexcan_flags enumerations
  * to ditermine which error is generated.
  */
enum _flexcan_error_flags
{
    Enum_Flexcan_TxErrorWarningFlag = FLEXCAN_ESR1_TXWRN_Msk,   /*!< Tx Error Warning Status. */
    Enum_Flexcan_RxErrorWarningFlag = FLEXCAN_ESR1_RXWRN_Msk,   /*!< Rx Error Warning Status. */
    Enum_Flexcan_StuffingError      = FLEXCAN_ESR1_STFERR_Msk,  /*!< Stuffing Error. */
    Enum_Flexcan_FormError          = FLEXCAN_ESR1_FRMERR_Msk,  /*!< Form Error. */
    Enum_Flexcan_CrcError           = FLEXCAN_ESR1_CRCERR_Msk,  /*!< Cyclic Redundancy Check Error. */
    Enum_Flexcan_AckError           = FLEXCAN_ESR1_ACKERR_Msk,  /*!< Received no ACK on transmission. */
    Enum_Flexcan_Bit0Error          = FLEXCAN_ESR1_BIT0ERR_Msk, /*!< Unable to send dominant bit. */
    Enum_Flexcan_Bit1Error          = FLEXCAN_ESR1_BIT1ERR_Msk  /*!< Unable to send recessive bit. */
};


/**
  * @brief  FlexCAN Rx FIFO status flags.
  *
  * The FlexCAN Rx FIFO Status enumerations are used to determine the status of the
  * Rx FIFO. Because Rx FIFO occupy the MB0 ~ MB7 (Rx Fifo filter also occupies
  * more Message Buffer space), Rx FIFO status flags are mapped to the corresponding
  * Message Buffer status flags.
  */
enum
{
    Enum_Flexcan_RxFifoOverflowFlag = FLEXCAN_IFLAG1_BUF7I_Msk, /*!< Rx FIFO overflow flag. */
    Enum_Flexcan_RxFifoWarningFlag  = FLEXCAN_IFLAG1_BUF6I_Msk, /*!< Rx FIFO almost full flag. */
    Enum_Flexcan_RxFifoFrameAvlFlag = FLEXCAN_IFLAG1_BUF5I_Msk  /*!< Frames available in Rx FIFO flag. */
};

#if defined (__CC_ARM)
#pragma anon_unions
#endif

/**
  * @brief FlexCAN message frame structure.
  */
typedef struct _flexcan_frame
{
    struct
    {
        uint32_t timestamp : 16;       /*!< FlexCAN internal Free-Running Counter Time Stamp. */
        uint32_t length    : 4;        /*!< CAN frame payload length in bytes(Range: 0~8). */
        uint32_t type      : 1;        /*!< CAN Frame Type(DATA or REMOTE). */
        uint32_t format    : 1;        /*!< CAN Frame Identifier(STD or EXT format). */
        uint32_t           : 1;        /*!< Reserved. */
        uint32_t idhit     : 9;        /*!< CAN Rx FIFO filter hit id(This value is only used in Rx FIFO receive mode). */
    };
    struct
    {
        uint32_t id : 29;              /*!< CAN Frame Identifier. */
        uint32_t    : 3;               /*!< Reserved. */
    };
    union
    {
        struct
        {
            uint32_t dataWord0;        /*!< CAN Frame payload word0. */
            uint32_t dataWord1;        /*!< CAN Frame payload word1. */
        };
        struct
        {
            uint8_t dataByte3;         /*!< CAN Frame payload byte3. */
            uint8_t dataByte2;         /*!< CAN Frame payload byte2. */
            uint8_t dataByte1;         /*!< CAN Frame payload byte1. */
            uint8_t dataByte0;         /*!< CAN Frame payload byte0. */
            uint8_t dataByte7;         /*!< CAN Frame payload byte7. */
            uint8_t dataByte6;         /*!< CAN Frame payload byte6. */
            uint8_t dataByte5;         /*!< CAN Frame payload byte5. */
            uint8_t dataByte4;         /*!< CAN Frame payload byte4. */
        };
    };
} flexcan_frame_t;

/**
  * @brief FlexCAN FD message frame structure.
  */
typedef struct _flexcan_fd_frame
{
    struct
    {
        uint32_t timestamp  : 16;      /*!< FlexCAN internal Free-Running Counter Time Stamp. */
        uint32_t length     : 4;       /*!< CAN frame data length in bytes, range see @ref _flexcan_fd_frame_length. */
        uint32_t type       : 1;       /*!< CAN Frame Type(DATA or REMOTE). */
        uint32_t format     : 1;       /*!< CAN Frame Identifier(STD or EXT format). */
        uint32_t srr        : 1;       /*!< Substitute Remote request. */
        uint32_t RESERVED_0 : 1;
        uint32_t code       : 4;       /*!< Message Buffer Code. */
        uint32_t RESERVED_1 : 1;
        uint32_t esi        : 1;       /*!< Error State Indicator. */
        uint32_t brs        : 1;       /*!< Bit Rate Switch. */
        uint32_t edl        : 1;       /*!< Extended Data Length. */
    };
    struct
    {
        uint32_t id         : 29;      /*!< CAN Frame Identifier. */
        uint32_t RESERVED_3 : 3;       /*!< Reserved. */
    };
    union
    {
        struct
        {
            uint32_t dataWord[16];     /*!< CAN FD Frame payload, 16 double word maximum. */
        };
        struct
        {
            uint8_t dataByte3;         /*!< CAN Frame payload byte3. */
            uint8_t dataByte2;         /*!< CAN Frame payload byte2. */
            uint8_t dataByte1;         /*!< CAN Frame payload byte1. */
            uint8_t dataByte0;         /*!< CAN Frame payload byte0. */
            uint8_t dataByte7;         /*!< CAN Frame payload byte7. */
            uint8_t dataByte6;         /*!< CAN Frame payload byte6. */
            uint8_t dataByte5;         /*!< CAN Frame payload byte5. */
            uint8_t dataByte4;         /*!< CAN Frame payload byte4. */
            uint8_t dataByte11;        /*!< CAN Frame payload byte11. */
            uint8_t dataByte10;        /*!< CAN Frame payload byte10. */
            uint8_t dataByte9;         /*!< CAN Frame payload byte9. */
            uint8_t dataByte8;         /*!< CAN Frame payload byte8. */
            uint8_t dataByte15;        /*!< CAN Frame payload byte15. */
            uint8_t dataByte14;        /*!< CAN Frame payload byte14. */
            uint8_t dataByte13;        /*!< CAN Frame payload byte13. */
            uint8_t dataByte12;        /*!< CAN Frame payload byte12. */
            uint8_t dataByte19;        /*!< CAN Frame payload byte19. */
            uint8_t dataByte18;        /*!< CAN Frame payload byte18. */
            uint8_t dataByte17;        /*!< CAN Frame payload byte17. */
            uint8_t dataByte16;        /*!< CAN Frame payload byte16. */
            uint8_t dataByte23;        /*!< CAN Frame payload byte23. */
            uint8_t dataByte22;        /*!< CAN Frame payload byte22. */
            uint8_t dataByte21;        /*!< CAN Frame payload byte21. */
            uint8_t dataByte20;        /*!< CAN Frame payload byte20. */
            uint8_t dataByte27;        /*!< CAN Frame payload byte27. */
            uint8_t dataByte26;        /*!< CAN Frame payload byte26. */
            uint8_t dataByte25;        /*!< CAN Frame payload byte25. */
            uint8_t dataByte24;        /*!< CAN Frame payload byte24. */
            uint8_t dataByte31;        /*!< CAN Frame payload byte31. */
            uint8_t dataByte30;        /*!< CAN Frame payload byte30. */
            uint8_t dataByte29;        /*!< CAN Frame payload byte29. */
            uint8_t dataByte28;        /*!< CAN Frame payload byte28. */
            uint8_t dataByte35;        /*!< CAN Frame payload byte35. */
            uint8_t dataByte34;        /*!< CAN Frame payload byte34. */
            uint8_t dataByte33;        /*!< CAN Frame payload byte33. */
            uint8_t dataByte32;        /*!< CAN Frame payload byte32. */
            uint8_t dataByte39;        /*!< CAN Frame payload byte39. */
            uint8_t dataByte38;        /*!< CAN Frame payload byte38. */
            uint8_t dataByte37;        /*!< CAN Frame payload byte37. */
            uint8_t dataByte36;        /*!< CAN Frame payload byte36. */
            uint8_t dataByte43;        /*!< CAN Frame payload byte43. */
            uint8_t dataByte42;        /*!< CAN Frame payload byte42. */
            uint8_t dataByte41;        /*!< CAN Frame payload byte41. */
            uint8_t dataByte40;        /*!< CAN Frame payload byte40. */
            uint8_t dataByte47;        /*!< CAN Frame payload byte47. */
            uint8_t dataByte46;        /*!< CAN Frame payload byte46. */
            uint8_t dataByte45;        /*!< CAN Frame payload byte45. */
            uint8_t dataByte44;        /*!< CAN Frame payload byte44. */
            uint8_t dataByte51;        /*!< CAN Frame payload byte51. */
            uint8_t dataByte50;        /*!< CAN Frame payload byte50. */
            uint8_t dataByte49;        /*!< CAN Frame payload byte49. */
            uint8_t dataByte48;        /*!< CAN Frame payload byte48. */
            uint8_t dataByte55;        /*!< CAN Frame payload byte55. */
            uint8_t dataByte54;        /*!< CAN Frame payload byte54. */
            uint8_t dataByte53;        /*!< CAN Frame payload byte53. */
            uint8_t dataByte52;        /*!< CAN Frame payload byte52. */
            uint8_t dataByte59;        /*!< CAN Frame payload byte59. */
            uint8_t dataByte58;        /*!< CAN Frame payload byte58. */
            uint8_t dataByte57;        /*!< CAN Frame payload byte57. */
            uint8_t dataByte56;        /*!< CAN Frame payload byte56. */
            uint8_t dataByte63;        /*!< CAN Frame payload byte63. */
            uint8_t dataByte62;        /*!< CAN Frame payload byte62. */
            uint8_t dataByte61;        /*!< CAN Frame payload byte61. */
            uint8_t dataByte60;        /*!< CAN Frame payload byte60. */
        };
    };
} flexcan_fd_frame_t;

/**
  * @brief FlexCAN protocol timing characteristic configuration structure.
  */
typedef struct _flexcan_timing_config
{
    uint16_t      preDivider;          /*!< Clock Pre-scaler Division Factor. */
    uint8_t       rJumpwidth;          /*!< Re-sync Jump Width. */
    uint8_t       phaseSeg1;           /*!< Phase Segment 1. */
    uint8_t       phaseSeg2;           /*!< Phase Segment 2. */
    uint8_t       propSeg;             /*!< Propagation Segment. */

     /*!< FlexCAN has flexible data rate. */
    uint16_t      fpreDivider;         /*!< CAN FD data phase Clock Pre-scaler Division Factor. */
    uint8_t       frJumpwidth;         /*!< CAN FD data phase Re-sync Jump Width. */
    uint8_t       fphaseSeg1;          /*!< CAN FD data phase Phase Segment 1. */
    uint8_t       fphaseSeg2;          /*!< CAN FD data phase Phase Segment 2. */
    uint8_t       fpropSeg;            /*!< CAN FD data phase Propagation Segment. */
} flexcan_timing_config_t;


/**
  * @brief FlexCAN module configuration structure.
  */
typedef struct _flexcan_config
{
    uint32_t                 baudRate;             /*!< FlexCAN baud rate in bps. */
    uint32_t                 baudRateFD;           /*!< FlexCAN FD baud rate in bps. */
    flexcan_clock_source_t   clkSrc;               /*!< Clock source for FlexCAN Protocol Engine. */
    flexcan_wake_up_source_t wakeupSrc;            /*!< Wake up source selection. */
    uint8_t                  maxMbNum;             /*!< The maximum number of Message Buffers used by user. */
    bool                     enableLoopBack;       /*!< Enable or Disable Loop Back Self Test Mode. */
    bool                     enableTimerSync;      /*!< Enable or Disable Timer Synchronization. */
    bool                     enableSelfWakeup;     /*!< Enable or Disable Self Wakeup Mode. */
    bool                     enableIndividMask;    /*!< Enable or Disable Rx Individual Mask. */
    bool                     disableSelfReception; /*!< Enable or Disable Self Reflection. */
    bool                     enableListenOnlyMode; /*!< Enable or Disable Listen Only Mode. */

    flexcan_timing_config_t  timingConfig;         /*!< Protocol timing. */
} flexcan_config_t;

/**
  * @brief  FlexCAN Receive Message Buffer configuration structure
  *
  * This structure is used as the parameter of FLEXCAN_RxMbConfig() function.
  * The FLEXCAN_RxMbConfig() function is used to configure FlexCAN Receive
  * Message Buffer. The function abort previous receiving process, clean the
  * Message Buffer and activate the Rx Message Buffer using given Message Buffer
  * setting.
  */
typedef struct _flexcan_rx_mb_config
{
    uint32_t               id;         /*!< CAN Message Buffer Frame Identifier. */
    flexcan_frame_format_t format;     /*!< CAN Frame Identifier format(Standard of Extend). */
    flexcan_frame_type_t   type;       /*!< CAN Frame Type(Data or Remote). */
} flexcan_rx_mb_config_t;

