SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/HAL_Lib/inc/hal_flexcan.h
/**
  * @brief FlexCAN Rx FIFO configuration structure.
  */
typedef struct _flexcan_rx_fifo_config
{
    uint32_t                     *idFilterTable; /*!< Pointer to the FlexCAN Rx FIFO identifier filter table. */
    uint8_t                       idFilterNum;   /*!< The quantity of filter elements. */
    flexcan_rx_fifo_filter_type_t idFilterType;  /*!< The FlexCAN Rx FIFO Filter type. */
    flexcan_rx_fifo_priority_t    priority;      /*!< The FlexCAN Rx FIFO receive priority. */
} flexcan_rx_fifo_config_t;

/**
  * @brief FlexCAN FD Rx FIFO configuration structure.
  */
typedef struct _flexcan_fd_rx_fifo_config {
    uint32_t                          *idFilterTable;        /*!< Pointer to the FlexCAN FD Rx FIFO identifier filter table. */
    uint8_t                            rfWaterline;          /*!< Set the enhanced Rx FIFO waterline, The minimum number of CAN messages to store. */
    flexcan_fd_rx_fifo_filter_type_t   idFilterType;         /*!< The FlexCAN Rx FIFO Filter type. */
    flexcan_fd_rx_fifo_filter_format_t idFilterFormat;       /*!< The FlexCAN Rx FIFO Filter format. */
} flexcan_fd_rx_fifo_config_t;

/**
  * @brief FlexCAN Message Buffer transfer.
  */
typedef struct _flexcan_mb_transfer
{
    flexcan_fd_frame_t      *framefd;  /*!< The buffer of CAN FD Message to be transfer. */
    flexcan_frame_t         *frame;    /*!< The buffer of CAN Message to be transfer. */
    uint8_t                  mbIdx;    /*!< The index of Message buffer used to transfer Message. */
} flexcan_mb_transfer_t;

/**
  * @brief FlexCAN Rx FIFO transfer.
  */
typedef struct _flexcan_fifo_transfer
{
    flexcan_fd_frame_t *framefd;      /*!< The buffer of CAN Message to be received from Enhanced Rx FIFO. */
    flexcan_frame_t *frame;           /*!< The buffer of CAN Message to be received from Rx FIFO. */
    uint32_t frameNum;        /*!< Number of CAN Message need to be received from Legacy or Ehanced Rx FIFO. */
} flexcan_fifo_transfer_t;

/**
  * @brief FlexCAN handle structure definition.
  */
typedef struct _flexcan_handle flexcan_handle_t;

/**
  * @brief FlexCAN transfer callback function.
  *
  * The FlexCAN transfer callback returns a value from the underlying layer.
  * If the status equals to Status_Flexcan_ErrorStatus, the result parameter is the Content of
  * FlexCAN status register which can be used to get the working status(or error status) of FlexCAN module.
  * If the status equals to other FlexCAN Message Buffer transfer status, the result is the index of
  * Message Buffer that generate transfer event.
  * If the status equals to other FlexCAN Message Buffer transfer status, the result is meaningless and should be
  * Ignored.
  */
typedef void (*flexcan_transfer_callback_t)(FLEXCAN_TypeDef *flex_can, flexcan_handle_t *handle, uint32_t status, uint32_t result, void *userData);

/**
  * @brief FlexCAN handle structure.
  */
struct _flexcan_handle
{
    flexcan_transfer_callback_t       callback; /*!< Callback function. */
    void                             *userData; /*!< FlexCAN callback function parameter. */
    flexcan_frame_t *volatile         mbFrameBuf[CAN_WORD1_COUNT];
    flexcan_fd_frame_t *volatile      mbFDFrameBuf[CAN_WORD1_COUNT];
    /*!< The buffer for received data from Message Buffers. ------------------*/
    flexcan_frame_t *volatile         rxFifoFrameBuf;             /*!< The buffer for received data from Rx FIFO. */
    uint32_t                          rxFifoFrameNum;         /*!< The number of CAN messages remaining to be received from Rx FIFO. */
    uint32_t                          rxFifoTransferTotalNum;  /*!< Total CAN Message number need to be received from Rx FIFO. */
    volatile uint8_t                  mbState[CAN_WORD1_COUNT];   /*!< Message Buffer transfer state. */
    volatile uint8_t                  rxFifoState;                /*!< Rx FIFO transfer state. */
    volatile uint32_t                 timestamp[CAN_WORD1_COUNT]; /*!< Mailbox transfer timestamp. */
};

/**
  * @brief FlexCAN FD Message Buffer Size.
  */
typedef enum
{
    FlexCANFD_TX_0Byte_DataLen   = 0,  /* FlexCANFD sends 0 byte of data length per frame */
    FlexCANFD_TX_1Byte_DataLen   = 1,  /* FlexCANFD sends 1 byte of data length per frame */
    FlexCANFD_TX_2Bytes_DataLen  = 2,  /* FlexCANFD sends 2 bytes of data length per frame */
    FlexCANFD_TX_3Bytes_DataLen  = 3,  /* FlexCANFD sends 3 bytes of data length per frame */
    FlexCANFD_TX_4Bytes_DataLen  = 4,  /* FlexCANFD sends 4 bytes of data length per frame */
    FlexCANFD_TX_5Bytes_DataLen  = 5,  /* FlexCANFD sends 5 bytes of data length per frame */
    FlexCANFD_TX_6Bytes_DataLen  = 6,  /* FlexCANFD sends 6 bytes of data length per frame */
    FlexCANFD_TX_7Bytes_DataLen  = 7,  /* FlexCANFD sends 7 bytes of data length per frame */
    FlexCANFD_TX_8Bytes_DataLen  = 8,  /* FlexCANFD sends 8 bytes of data length per frame */
    FlexCANFD_TX_12Bytes_DataLen = 9,  /* FlexCANFD sends 12 bytes of data length per frame */
    FlexCANFD_TX_16Bytes_DataLen = 10, /* FlexCANFD sends 16 bytes of data length per frame */
    FlexCANFD_TX_20Bytes_DataLen = 11, /* FlexCANFD sends 20 bytes of data length per frame */
    FlexCANFD_TX_24Bytes_DataLen = 12, /* FlexCANFD sends 24 bytes of data length per frame */
    FlexCANFD_TX_32Bytes_DataLen = 13, /* FlexCANFD sends 32 bytes of data length per frame */
    FlexCANFD_TX_48Bytes_DataLen = 14, /* FlexCANFD sends 48 bytes of data length per frame */
    FlexCANFD_TX_64Bytes_DataLen = 15  /* FlexCANFD sends 64 bytes of data length per frame */
} FLEXCANFD_Tx_DataLen_Type;

/**
  * @}
  */



/** @defgroup FLEXCAN_Exported_Functions
  * @{
  */
void FLEXCAN_EnterFreezeMode(FLEXCAN_TypeDef *flex_can);
void FLEXCAN_ExitFreezeMode(FLEXCAN_TypeDef *flex_can);
ErrorStatus FLEXCAN_CalculateImprovedTimingValues(uint32_t baudRate, uint32_t sourceClock_Hz, flexcan_timing_config_t *pTimingConfig);
void FLEXCAN_Init(FLEXCAN_TypeDef *flex_can, const flexcan_config_t *pConfig);
void FLEXCAN_Deinit(FLEXCAN_TypeDef *flex_can);
void FLEXCAN_GetDefaultConfig(flexcan_config_t *pConfig);
void FLEXCAN_SetTimingConfig(FLEXCAN_TypeDef *flex_can, const flexcan_timing_config_t *pConfig);
void FLEXCAN_SetRxMbGlobalMask(FLEXCAN_TypeDef *flex_can, uint32_t mask);
void FLEXCAN_SetRxFifoGlobalMask(FLEXCAN_TypeDef *flex_can, uint32_t mask);
void FLEXCAN_SetRxIndividualMask(FLEXCAN_TypeDef *flex_can, uint8_t maskIdx, uint32_t mask);
void FLEXCAN_TxMbConfig(FLEXCAN_TypeDef *flex_can, uint8_t mbIdx, FunctionalState state);
void FLEXCAN_RxMbConfig(FLEXCAN_TypeDef *flex_can, uint8_t mbIdx, const flexcan_rx_mb_config_t *pRxMbConfig, FunctionalState state);
void FLEXCAN_RxFifoConfig(FLEXCAN_TypeDef *flex_can, const flexcan_rx_fifo_config_t *pRxFifoConfig, FunctionalState state);
void FLEXCAN_EnableRxFifoDMA(FLEXCAN_TypeDef *flex_can, FunctionalState state);


/**
  * @brief  Gets the FlexCAN module interrupt flags.
  *
  * This function gets all FlexCAN status flags. The flags are returned as the logical
  * OR value of the enumerators @ref _flexcan_flags. To check the specific status,
  * compare the return value with enumerators in @ref _flexcan_flags.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @return FlexCAN status flags which are ORed by the enumerators in the _flexcan_flags.
  */
__STATIC_INLINE uint32_t FLEXCAN_GetStatusFlags(FLEXCAN_TypeDef *flex_can)
{
    return flex_can->ESR1;
}

/**
  * @brief  Clears status flags with the provided mask.
  *
  * This function clears the FlexCAN status flags with a provided mask. An automatically cleared flag
  * can't be cleared by this function.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The status flags to be cleared, it is logical OR value of @ref _flexcan_flags.
  */
__STATIC_INLINE void FLEXCAN_ClearStatusFlags(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
     /* Write 1 to clear status flag. -----------------------------------------*/
    flex_can->ESR1 = mask;
}

/**
  * @brief  Gets the FlexCAN Bus Error Counter value.
  *
  * This function gets the FlexCAN Bus Error Counter value for both Tx and
  * Rx direction. These values may be needed in the upper layer error handling.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param txErrBuf Buffer to store Tx Error Counter value.
  * @param rxErrBuf Buffer to store Rx Error Counter value.
  */
__STATIC_INLINE void FLEXCAN_GetBusErrCount(FLEXCAN_TypeDef *flex_can, uint8_t *txErrBuf, uint8_t *rxErrBuf)
{
    if (NULL != txErrBuf)
    {
        *txErrBuf = (uint8_t)((flex_can->ECR & FLEXCAN_ECR_TXERRCNT_Msk) >> FLEXCAN_ECR_TXERRCNT_Pos);
    }

    if (NULL != rxErrBuf)
    {
        *rxErrBuf = (uint8_t)((flex_can->ECR & FLEXCAN_ECR_RXERRCNT_Msk) >> FLEXCAN_ECR_RXERRCNT_Pos);
    }
}

/**
  * @brief  Gets the FlexCAN Message Buffer interrupt flags.
  *
  * This function gets the interrupt flags of a given Message Buffers.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The ORed FlexCAN Message Buffer mask.
  * @return The status of given Message Buffers.
  */
__STATIC_INLINE uint32_t FLEXCAN_GetMbStatusFlags(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
    return (flex_can->IFLAG1 & mask);
}

/**
  * @brief  Clears the FlexCAN Message Buffer interrupt flags.
  *
  * This function clears the interrupt flags of a given Message Buffers.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The ORed FlexCAN Message Buffer mask.
  */
__STATIC_INLINE void FLEXCAN_ClearMbStatusFlags(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
    flex_can->IFLAG1 = mask;
}

/**
  * @brief  Enables FlexCAN interrupts according to the provided mask.
  *
  * This function enables the FlexCAN interrupts according to the provided mask. The mask
  * is a logical OR of enumeration members, see @ref _flexcan_interrupt_enable.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The interrupts to enable. Logical OR of @ref _flexcan_interrupt_enable.
  */
__STATIC_INLINE void FLEXCAN_EnableInterrupts(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
     /* Solve Wake Up Interrupt. ----------------------------------------------*/
    if ((uint32_t)Enum_Flexcan_WakeUpInterruptEnable == (mask & (uint32_t)Enum_Flexcan_WakeUpInterruptEnable))
    {
        flex_can->MCR |= FLEXCAN_MCR_WAKMSK_Msk;
    }

     /* Solve others. ---------------------------------------------------------*/
    flex_can->CTRL1 |= (mask & (~((uint32_t)Enum_Flexcan_WakeUpInterruptEnable)));
}

/**
  * @brief  Disables FlexCAN interrupts according to the provided mask.
  *
  * This function disables the FlexCAN interrupts according to the provided mask. The mask
  * is a logical OR of enumeration members, see @ref _flexcan_interrupt_enable.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The interrupts to disable. Logical OR of @ref _flexcan_interrupt_enable.
  */
__STATIC_INLINE void FLEXCAN_DisableInterrupts(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
     /* Solve Wake Up Interrupt. ----------------------------------------------*/
    if ((uint32_t)Enum_Flexcan_WakeUpInterruptEnable == (mask & (uint32_t)Enum_Flexcan_WakeUpInterruptEnable))
    {
        flex_can->MCR &= ~FLEXCAN_MCR_WAKMSK_Msk;
    }

     /* Solve others. ---------------------------------------------------------*/
    flex_can->CTRL1 &= ~(mask & (~((uint32_t)Enum_Flexcan_WakeUpInterruptEnable)));
}

/**
  * @brief  Enables FlexCAN Message Buffer interrupts.
  *
  * This function enables the interrupts of given Message Buffers.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The ORed FlexCAN Message Buffer mask.
  */
__STATIC_INLINE void FLEXCAN_EnableMbInterrupts(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
    flex_can->IMASK1 |= mask;
}

/**
  * @brief  Disables FlexCAN Message Buffer interrupts.
  *
  * This function disables the interrupts of given Message Buffers.
  *
  * @param flex_can FlexCAN peripheral Struct Point.
  * @param mask The ORed FlexCAN Message Buffer mask.
  */
__STATIC_INLINE void FLEXCAN_DisableMbInterrupts(FLEXCAN_TypeDef *flex_can, uint32_t mask)
{
    flex_can->IMASK1 &= ~mask;
}

/**
  * @brief  Enables or disables the FlexCAN module operation.
  *
  * This function enables or disables the FlexCAN module.
  *
  * @param flex_can FlexCAN flex_can pointer.
  * @param  state: new state of the adc peripheral.
  */
__STATIC_INLINE void FLEXCAN_Cmd(FLEXCAN_TypeDef *flex_can, FunctionalState state)
{
    if (state)
    {
        flex_can->MCR &= ~FLEXCAN_MCR_MDIS_Msk; /*!< Enable FlexCAN */

